ProvisioningTemplates/SGOTV263SI.txt

<soapenv:Envelope
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ord = "http://soa.talktalk.net/OrderEntryServices"
    xmlns:add = "http://xmlns.talktalkplc.com/schema/CDM/Address"
    xmlns:card = "http://xmlns.talktalkplc.com/schema/CDM/Card"
    xmlns:ead = "http://xmlns.talktalkplc.com/schema/CDM/EAddress"
    xmlns:tel = "http://xmlns.talktalkplc.com/schema/CDM/TeleNumber">
    <soapenv:Header/>
    <soapenv:Body>
        <ord:SubmitGatewayOrderInputRequest>
            <ord:sourceChannel>TALKTALK SALES SITE</ord:sourceChannel>
            <ord:GatewayOrder>
                <ord:orderType>PROVIDE PACKAGE</ord:orderType>
                <ord:orderPlacementDate>M_date1T11:58:51+01:00</ord:orderPlacementDate>
                <ord:customerRequiredDate>M_crd</ord:customerRequiredDate>
                <ord:branchId>5625</ord:branchId>
                <ord:activityId>3</ord:activityId>
                <ord:brandId>TALKTALK</ord:brandId>
                <ord:exchangeCode>EMKINGS</ord:exchangeCode>
                <ord:sourceChannel>TALKTALK SALES SITE</ord:sourceChannel>
                <ord:primaryStbProductId>1</ord:primaryStbProductId>
                <ord:installationMethod>SELF INSTALL</ord:installationMethod>
                <ord:OriginatingAgent>
                    <ord:originatingAgentId>456789</ord:originatingAgentId>
                    <ord:originatingAgentType>0</ord:originatingAgentType>
                </ord:OriginatingAgent>
                <ord:Resources>
                    <ord:Resource>
                        <ord:resourceId>M_cli</ord:resourceId>
                        <ord:type>CLI</ord:type>
                    </ord:Resource>
                </ord:Resources>
                <ord:Attributes>
                    <ord:Attribute>
                        <ord:name>networkResultsReference</ord:name>
                        <ord:value>M_nrr</ord:value>
                    </ord:Attribute>
                    <ord:Attribute>
                        <ord:name>estimatedDownstreamSpeed80</ord:name>
                        <ord:value>5707</ord:value>
                    </ord:Attribute>
                    <ord:Attribute>
                        <ord:name>estimatedDownstreamSpeed50</ord:name>
                        <ord:value>3700</ord:value>
                    </ord:Attribute>
                    <ord:Attribute>
                        <ord:name>estimatedDownstreamSpeed20</ord:name>
                        <ord:value>2276</ord:value>
                    </ord:Attribute>
                    <ord:Attribute>
                        <ord:name>estimatedDownstreamSpeed10</ord:name>
                        <ord:value>1573</ord:value>
                    </ord:Attribute>
                    <ord:Attribute>
                        <ord:name>estimatedUpstreamSpeed</ord:name>
                        <ord:value>1000</ord:value>
                    </ord:Attribute>
                </ord:Attributes>
                <ord:InstallationAddress>
                    <add:AddressSplit>
                        <add:propertyNumber>M_H_NO</add:propertyNumber>
                        <add:streetName>M_addr_line</add:streetName>
                        <add:locality>Sturry</add:locality>
                    </add:AddressSplit>
                    <add:postalTown>CANTERBURY</add:postalTown>
                    <add:county>Middlesex</add:county>
                    <add:country>UK</add:country>
                    <add:postcode>M_pst1_pst2</add:postcode>
                </ord:InstallationAddress>
                <ord:ExternalReferences>
                    <ord:ExternalReference>
                        <ord:name>Supplier Order ID</ord:name>
                        <ord:value>N1159</ord:value>
                    </ord:ExternalReference>
                </ord:ExternalReferences>
                <ord:OrderLines>
                    <ord:OrderLine>
                        <ord:productId>263</ord:productId>
                        <ord:sgoProductType>PACKAGE</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10609</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10019</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10020</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10021</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10027</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10081</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10082</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10086</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10091</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10424</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10757</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11738</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11744</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>12936</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>14021</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20635</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20755</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20759</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11759</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10144</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20531</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20716</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10238</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10239</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10242</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10243</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10244</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>17205</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                </ord:OrderLines>
                <ord:Account>
                    <ord:AccountDetails>
                        <ord:paymentMethod>DIRECT DEBIT</ord:paymentMethod>
                        <ord:DirectDebitDetail>
                            <ord:BankAccount>
                                <ord:bankName>HSBC BANK PLC</ord:bankName>
                                <ord:bankAccountName>M_first_name M_last_name</ord:bankAccountName>
                                <ord:bankAccountNumber>31020293</ord:bankAccountNumber>
                                <ord:bankCode>404720</ord:bankCode>
                            </ord:BankAccount>
                        </ord:DirectDebitDetail>
                        <ord:BillingAddress>
                            <add:AddressSplit>
                                <add:propertyNumber>M_H_NO</add:propertyNumber>
                                <add:streetName>M_addr_line</add:streetName>
                                <add:locality>Sturry</add:locality>
                            </add:AddressSplit>
                            <add:postalTown>M_town</add:postalTown>
                            <add:county>Middlesex</add:county>
                            <add:country>UK</add:country>
                            <add:postcode>M_pst1_pst2</add:postcode>
                        </ord:BillingAddress>
                    </ord:AccountDetails>
                    <ord:InvoiceHeader>
                        <ord:invoiceMediaType>EMAIL</ord:invoiceMediaType>
                    </ord:InvoiceHeader>
                </ord:Account>
                <ord:Customer>
                    <ord:CustomerDetails>
                        <ord:title>MR</ord:title>
                        <ord:firstName>M_first_name</ord:firstName>
                        <ord:lastName>M_last_name</ord:lastName>
                        <ord:dateOfBirth>M_dob</ord:dateOfBirth>
                        <ord:gender>NOT_SPECIFIED</ord:gender>
                        <ord:MarketingPrefDetails>
                            <ord:marketingPrefEmailFlag>true</ord:marketingPrefEmailFlag>
                            <ord:marketingPrefSMSFlag>true</ord:marketingPrefSMSFlag>
                            <ord:marketingPrefLetterFlag>true</ord:marketingPrefLetterFlag>
                            <ord:marketingPrefVoiceFlag>true</ord:marketingPrefVoiceFlag>
                        </ord:MarketingPrefDetails>
                        <ord:EaddressDetails>
                            <ord:EaddressDetail>
                                <ead:emailAddress>M_email_id</ead:emailAddress>
                                <ead:emailAddressType>EMAIL</ead:emailAddressType>
                            </ord:EaddressDetail>
                        </ord:EaddressDetails>
                        <ord:Telephones>
                            <ord:Telephone>
                                <tel:telephoneNumber>02600138646</tel:telephoneNumber>
                                <tel:telephoneType>HOME</tel:telephoneType>
                            </ord:Telephone>
                        </ord:Telephones>
                        <ord:CustomerAddress>
                            <add:AddressSplit>
                                <add:propertyNumber>M_H_NO</add:propertyNumber>
                                <add:streetName>M_addr_line</add:streetName>
                                <add:locality>Sturry</add:locality>
                            </add:AddressSplit>
                            <add:postalTown>M_town</add:postalTown>
                            <add:county>Middlesex</add:county>
                            <add:country>UK</add:country>
                            <add:postcode>M_pst1_pst2</add:postcode>
                        </ord:CustomerAddress>
                    </ord:CustomerDetails>
                </ord:Customer>
            </ord:GatewayOrder>
            <ord:correlationId>263ISAdapSplitM_cli</ord:correlationId>
        </ord:SubmitGatewayOrderInputRequest>
    </soapenv:Body>
</soapenv:Envelope>